Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: List the options create_database accepts on this engine, with their allowed values.
fr: Listez les options que create_database accepte sur ce moteur, avec leurs valeurs autorisées.
ko: 이 엔진에서 create_database가 받는 옵션과 허용되는 값을 나열합니다.
tr: Bu motorda create_database'in kabul ettiği seçenekleri ve izin verilen değerlerini listeler.
vi: Liệt kê các tuỳ chọn mà create_database chấp nhận trên engine này, kèm giá trị được phép.
zh_hans: 列出 create_database 在该引擎上接受的选项及其允许的值。
zh_hant: 列出 create_database 在該引擎上接受的選項及其允許的值。

source: The target's definition could not be read: %@
fr: La définition de la cible n'a pas pu être lu : %@

source: Title
fr: Titre
ko: 제목
tr: Başlık
vi: Tiêu đề
zh_hans: 标题
zh_hant: 標題

source: Enterprise SQL with PL/SQL
fr: SQL d'entreprise avec PL/SQL
ko: PL/SQL을 지원하는 엔터프라이즈 SQL
tr: PL/SQL ile kurumsal SQL
vi: SQL doanh nghiệp với PL/SQL
zh_hans: 支持 PL/SQL 的企业级 SQL
zh_hant: 支援 PL/SQL 的企業級 SQL

source: PHP Serialized
fr: PHP serialisé
ko: PHP 직렬화
tr: PHP Serileştirilmiş
zh_hans: PHP 序列化
zh_hant: PHP 序列化

source: Exclude DEFINER clauses
fr: Exclure les clauses DEFINER
ko: DEFINER 절 제외
tr: DEFINER yan tümcelerini hariç tut
vi: Bỏ mệnh đề DEFINER
zh_hans: 排除 DEFINER 子句
zh_hant: 排除 DEFINER 子句

source: Sign in to iCloud in System Settings to enable sync.
fr: Connectez-vous à iCloud dans les paramètres système pour activer la synchronisation.
ko: 동기화를 활성화하려면 시스템 설정에서 iCloud에 로그인하십시오.
tr: Eşitlemeyi açmak için Sistem Ayarları'ndan iCloud'a giriş yapın.
vi: Đăng nhập iCloud trong Cài đặt hệ thống để bật đồng bộ.
zh_hans: 请在系统设置中登录 iCloud 以启用同步。
zh_hant: 請在系統設定中登入 iCloud 以啟用同步。

source: Refresh concurrently
fr: Recharger simultanément

source: Backup Dump Failed
fr: Échec du sauvegarde de la décharge
ko: 백업 덤프 실패
tr: Yedek dökümü başarısız oldu
vi: Dump sao lưu thất bại
zh_hans: 备份转储失败
zh_hant: 資料庫備份失敗

# Line %lld: %@
source: Line %1$lld: %2$@
fr: Ligne %1$lld : %2$@
ko: %1$lld행: %2$@
tr: Satır %lld: %@
vi: Dòng %lld: %@
zh_hans: 第 %lld 行：%@
zh_hant: 第 %1$lld 行：%2$@

source: The initialization function to call. Leave empty to use the one SQLite derives from the file name.
fr: La fonction d'initialisation à appeler. Laissez-la vide pour utiliser celle dérivée par SQLite du nom du fichier.

source: %1$@ row %2$lld: %3$@
fr: %1$@ ligne %2$lld : %3$@

source: String values to escape
fr: Valeurs de chaîne à échapper
ko: 이스케이프할 문자열 값
tr: Kaçışlanacak dize değerleri
vi: Các giá trị chuỗi cần escape
zh_hans: 要转义的字符串值
zh_hant: 要跳脫的字串值

source: This database did not return a query plan for the statement.
fr: Cette base de données n'a pas renvoyé un plan de requête pour la déclaration.
ko: 데이터베이스에서 이 문에 대한 쿼리 계획을 반환하지 않았습니다.
tr: Bu veritabanı ifade için bir sorgu planı döndürmedi.
vi: Cơ sở dữ liệu này không trả về kế hoạch truy vấn cho câu lệnh.
zh_hans: 此数据库没有为该语句返回查询计划。
zh_hant: 此資料庫沒有為該陳述式回傳查詢計畫。

source: Use your SuperGrok or X Premium+ subscription with no API key. Sign-in opens the Grok Build consent screen. This is an unofficial interface that may change.
fr: Utilisez votre abonnement SuperGrok ou X Premium+ sans clé API. La connexion ouvre l'écran de consentement Grok Build. Il s'agit d'une interface non officielle qui peut changer.
ko: API 키 없이 SuperGrok 또는 X Premium+ 구독을 사용합니다. 로그인하면 Grok Build 동의 화면이 열립니다. 이는 변경될 수 있는 비공식 인터페이스입니다.
tr: API anahtarı olmadan SuperGrok veya X Premium+ aboneliğinizi kullanın. Oturum açma, Grok Build onay ekranını açar. Bu, değişebilecek resmi olmayan bir arayüzdür.
vi: Dùng gói SuperGrok hoặc X Premium+ của bạn mà không cần khóa API. Khi đăng nhập sẽ mở màn hình đồng ý của Grok Build. Đây là giao diện không chính thức và có thể thay đổi.
zh_hans: 无需 API 密钥即可使用你的 SuperGrok 或 X Premium+ 订阅。登录时会打开 Grok Build 的授权页面。这是非官方接口，可能会变动。
zh_hant: 無需 API 金鑰即可使用你的 SuperGrok 或 X Premium+ 訂閱。登入時會開啟 Grok Build 的授權畫面。這是非官方介面，可能會變動。

source: Connection failed: %@
fr: Échec de la connexion : %@
ko: 연결 실패: %@
tr: Bağlantı başarısız: %@
vi: Kết nối thất bại: %@
zh_hans: 连接失败：%@
zh_hant: 連線失敗：%@

source: Client Certificates
fr: Certificats clients
ko: 클라이언트 인증서
tr: İstemci sertifikaları
vi: Chứng chỉ client
zh_hans: 客户端证书
zh_hant: 用戶端憑證

source: Connect via
fr: Se connecter via

source: Name a connection to run this on.
fr: Nommez une connexion pour exécuter cela.

source: Copy as URL
fr: Copier sous forme d'URL
ko: URL로 복사
tr: URL olarak kopyala
vi: Sao chép dạng URL
zh_hans: 复制为 URL
zh_hant: 複製為 URL

source: Region
fr: Région

source: The default %@ is not written in a form this engine shares.
fr: Le %@ par défaut n'est pas écrit dans un formulaire que ce moteur partage.

source: Collapse
fr: S'effondrer

source: Show Previous Connection
fr: Afficher la connexion précédente
ko: 이전 연결 보기
tr: Önceki Bağlantıyı Göster
vi: Hiện kết nối trước
zh_hans: 显示上一个连接
zh_hant: 顯示上一個連線

source: %lld selected
fr: %lld sélectionné
ko: %lld개 선택됨
tr: %lld seçili
vi: Đã chọn %lld
zh_hans: 已选择%lld个
zh_hant: 已選取 %lld 個

source: Layout for new connections on servers that support a database tree. Switch the current connection from the View menu.
fr: Configurez les nouvelles connexions sur les serveurs prenant en charge un arbre de base de données. Changez la connexion actuelle à partir du menu Affichage.
ko: 데이터베이스 트리를 지원하는 서버의 새 연결에 사용할 레이아웃입니다. 보기 메뉴에서 현재 연결의 레이아웃을 전환할 수 있습니다.
tr: Veritabanı ağacını destekleyen sunucularda yeni bağlantılar için düzen. Geçerli bağlantıyı Görünüm menüsünden değiştirin.
vi: Bố cục cho kết nối mới trên máy chủ hỗ trợ cây cơ sở dữ liệu. Chuyển đổi cho kết nối hiện tại từ menu Xem.
zh_hans: 支持数据库树的服务器上新建连接所用的布局。可在“视图”菜单中切换当前连接的布局。
zh_hant: 支援資料庫樹狀結構的伺服器上，新連線所用的版面配置。可從「檢視」選單切換目前連線的版面配置。

source: Are you sure you want to delete %lld connections? This cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer %lld connexions ? Cela ne peut pas être annulé.
ko: %lld개의 연결을 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
tr: %lld bağlantıyı silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.
vi: Bạn có chắc muốn xóa %lld kết nối? Hành động này không thể hoàn tác.
zh_hans: 确定要删除 %lld 个连接吗？此操作无法撤销。
zh_hant: 確定要刪除 %lld 個連線嗎？此操作無法復原。

source: Save Sidebar Changes
fr: Sauvegarder les modifications de la barre lat
ko: 사이드바 변경 사항 저장
tr: Kenar Çubuğu Değişikliklerini Kaydet
vi: Lưu thay đổi thanh bên
zh_hans: 保存侧边栏更改
zh_hant: 儲存側邊欄變更

source: Delete
fr: Supprimer
ko: 삭제
tr: Sil
vi: Xóa
zh_hans: 删除
zh_hant: 刪除

source: Restart TablePro to fully unload removed plugins.
fr: Redémarrez TablePro pour décharger complètement les plugins supprimés.
ko: 제거한 플러그인을 완전히 언로드하려면 TablePro를 재시작하십시오.
tr: Kaldırılan eklentilerin tamamen bellekten çıkması için TablePro'yu yeniden başlatın.
vi: Khởi động lại TablePro để gỡ hoàn toàn các plugin đã xoá.
zh_hans: 重启 TablePro 以完全卸载已移除的插件。
zh_hant: 重新啟動 TablePro 以完全解除載入已移除的外掛。

source: A sequence
fr: Une séquence
ko: 시퀀스는
tr: Bir dizi
vi: Một sequence
zh_hans: 序列
zh_hant: 序列

source: MongoDB gzipped archive
fr: Archives gzippées MongoDB

source: Reload lists the tables both sides share.
fr: Reload liste les tableaux que les deux côtés partagent.

source: %d plugins need an update to load.
fr: %d plugins nécessitent une mise à jour pour être chargés.
ko: %d개 플러그인을 불러오려면 업데이트해야 합니다.
tr: %d eklentinin yüklenmesi için güncelleme gerekiyor.
vi: %d plugin cần cập nhật để tải.
zh_hans: %d个插件需要更新才能加载。
zh_hant: %d 個外掛需要更新才能載入。

source: Materialized View Refreshed
fr: Vue matérialisée rafraîchie

source: Sign-in could not be verified. Please try again.
fr: La connexion n'a pas pu être vérifiée. Veuillez réessayer.
ko: 로그인을 확인할 수 없습니다. 다시 시도하십시오.
tr: Giriş doğrulanamadı. Lütfen tekrar deneyin.
vi: Không thể xác minh đăng nhập. Vui lòng thử lại.
zh_hans: 无法验证登录。请重试。
zh_hant: 無法驗證登入。請再試一次。

source: Select a user or role to view its privileges.
fr: Sélectionnez un utilisateur ou un rôle pour afficher ses privilèges.
ko: 권한을 볼 사용자 또는 역할을 선택하십시오.
tr: Yetkilerini görmek için bir kullanıcı veya rol seçin.
vi: Chọn một người dùng hoặc vai trò để xem quyền của họ.
zh_hans: 选择一个用户或角色以查看其权限。
zh_hant: 選擇一個使用者或角色以檢視其權限。

source: Query timed out after %d seconds
fr: La requête a expiré après %d secondes.
ko: %d초 후 쿼리 시간이 초과되었습니다
tr: Sorgu %d saniye sonra zaman aşımına uğradı
vi: Truy vấn đã hết thời gian chờ sau %d giây
zh_hans: 查询在 %d 秒后超时
zh_hant: 查詢在 %d 秒後逾時

source: Objects to Compare
fr: Objets à comparer
ko: 비교할 객체
tr: Karşılaştırılacak Nesneler
vi: Đối tượng cần so sánh
zh_hans: 要比较的对象
zh_hant: 要比較的物件

source: tablepro command
fr: Commande tablepro
ko: tablepro 명령
tr: tablepro komutu
vi: lệnh tablepro
zh_hans: tablepro 命令
zh_hant: tablepro 指令

source: List the privileges granted to one user or role, with the scope each applies to.
fr: Listez les privilèges accordés à un utilisateur ou un rôle, avec la portée à laquelle ils s'appliquent.
ko: 한 사용자 또는 역할에 부여된 권한과 각 권한이 적용되는 범위를 나열합니다.
tr: Bir kullanıcıya veya role verilen ayrıcalıkları, her birinin geçerli olduğu kapsamla birlikte listeler.
vi: Liệt kê các đặc quyền được cấp cho một người dùng hoặc vai trò, kèm phạm vi áp dụng của từng quyền.
zh_hans: 列出授予某个用户或角色的权限，以及每项权限适用的作用域。
zh_hant: 列出授予某個使用者或角色的權限，以及每項權限適用的範圍。

# %lld table%@ to export
source: %1$lld table%2$@ to export
fr: %1$lld table%2$@ à exporter
ko: %1$lld개 테이블%2$@ 내보내기
tr: %lld tablo%@ dışa aktarılacak
vi: %lld bảng%@ để xuất
zh_hans: %lld 个表%@待导出
zh_hant: 待匯出 %1$lld 個資料表%2$@

source: Show All Rows
fr: Afficher toutes les lignes
ko: 모든 행 보기
tr: Tüm Satırları Göster
vi: Hiện tất cả hàng
zh_hans: 显示所有行
zh_hant: 顯示所有列

source: No plugins found
fr: Aucun plugin trouvé
ko: 플러그인을 찾을 수 없음
vi: Không tìm thấy plugin
zh_hans: 未找到插件
zh_hant: 找不到外掛

source: Try again, or install the plugin from Settings > Plugins.
fr: Essayez à nouveau, ou installez le plugin depuis Paramètres > Plugins.

source: Host scope, for engines that use one
fr: Portée de l'hôte, pour les moteurs qui en utilisent un.
ko: 호스트 범위를 사용하는 엔진의 호스트 범위
tr: Kullanan motorlar için ana makine kapsamı
vi: Phạm vi host, với những engine có dùng
zh_hans: 主机作用域，适用于使用它的引擎
zh_hant: 主機範圍，適用於使用它的引擎

source: SSH Agent
fr: Agent SSH
ko: SSH 에이전트
tr: SSH Aracısı

source: Nothing in this script destroys data in %@.
fr: Rien dans ce script ne détruit les données dans %@.
ko: 이 스크립트에는 %@의 데이터를 파괴하는 내용이 없습니다.
tr: Bu betikte %@ içindeki veriyi yok eden hiçbir şey yok.
vi: Không có gì trong script này hủy dữ liệu trong %@.
zh_hans: 此脚本中没有任何内容会销毁 %@ 中的数据。
zh_hant: 此指令稿中沒有任何內容會銷毀 %@ 中的資料。

source: No pending changes
fr: Aucune modification en attente
ko: 대기 중인 변경 사항 없음
tr: Bekleyen değişiklik yok
vi: Không có thay đổi nào
zh_hans: 无待处理的更改
zh_hant: 無待處理的變更

source: Making %@ NOT NULL fails if any existing row holds NULL.
fr: La création de %@ NON NUL échoue si une ligne existante contient NUL.
ko: 기존 행에 NULL이 있으면 %@을(를) NOT NULL로 만드는 작업은 실패합니다.
tr: %@ sütununu NOT NULL yapmak, mevcut herhangi bir satır NULL tutuyorsa başarısız olur.
vi: Đặt %@ thành NOT NULL sẽ thất bại nếu có dòng hiện tại chứa NULL.
zh_hans: 如果现有任何行为 NULL，将 %@ 设为 NOT NULL 会失败。
zh_hant: 如果現有任何列為 NULL，將 %@ 設為 NOT NULL 會失敗。

source: None (Top Level)
fr: Aucun (niveau supérieur)
ko: 없음(최상위)
tr: Yok (Üst Düzey)
vi: Không (Cấp cao nhất)
zh_hans: 无（顶级）
zh_hant: 無（最上層）

source: With Headers
fr: Avec des en-têtes
ko: 헤더 포함
tr: Başlıklarla
vi: Kèm tiêu đề
zh_hans: 含表头
zh_hant: 含標題列

source: Sends the code to %@
fr: Envoie le code à %@

source: Leave blank to connect without authentication. The password is stored in the macOS Keychain.
fr: Laissez vide pour vous connecter sans authentification. Le mot de passe est stocké dans le portefeuille de clés macOS.
ko: 인증 없이 연결하려면 비워 두십시오. 암호는 macOS 키체인에 저장됩니다.
tr: Kimlik doğrulamasız bağlanmak için boş bırakın. Parola macOS Keychain'de saklanır.
vi: Để trống để kết nối không cần xác thực. Mật khẩu được lưu trong macOS Keychain.
zh_hans: 留空即可在不认证的情况下连接。密码保存在 macOS 钥匙串中。
zh_hant: 留空即可在不驗證的情況下連線。密碼儲存在 macOS 鑰匙圈中。

source: All rows
fr: Toutes les lignes
ko: 모든 행
tr: Tüm satırlar
vi: Tất cả dòng
zh_hans: 所有行
zh_hant: 所有列

source: Toggle Sidebar
fr: Changer la barre latérale
ko: 사이드바 표시/숨기기
tr: Kenar Çubuğunu Aç/Kapat
vi: Bật/tắt thanh bên
zh_hans: 切换侧栏
zh_hant: 切換側邊欄

source: Controls how external clients (Raycast, Cursor, Claude Desktop, AppleScript) access this connection. Tokens cannot exceed this level even with full-access scope.
fr: Contrôle la façon dont les clients externes (Raycast, Cursor, Claude Desktop, AppleScript) accèdent à cette connexion. Les jetons ne peuvent pas dépasser ce niveau même avec une portée d'accès complète.
ko: 외부 클라이언트(Raycast, Cursor, Claude Desktop)가 이 연결에 접근하는 방식을 제어합니다. full-access 범위의 토큰도 이 수준을 초과할 수 없습니다.
tr: Harici istemcilerin (Raycast, Cursor, Claude Desktop) bu bağlantıya nasıl erişeceğini kontrol eder. Token'lar tam erişim kapsamına sahip olsa bile bu düzeyi aşamaz.
vi: Kiểm soát cách các client bên ngoài (Raycast, Cursor, Claude Desktop) truy cập kết nối này. Token không thể vượt quá mức này kể cả khi có phạm vi truy cập đầy đủ.
zh_hans: 控制外部客户端（Raycast、Cursor、Claude Desktop）如何访问该连接。即使具有完全访问权限，令牌也无法超出此级别。
zh_hant: 控制外部用戶端（Raycast、Cursor、Claude Desktop）如何存取此連線。即使具有完整存取範圍,權杖也無法超出此層級。

source: Choose a source or a target first.
fr: Choisissez d'abord une source ou une cible.
ko: 먼저 원본 또는 대상을 선택하십시오.
tr: Önce bir kaynak ya da bir hedef seçin.
vi: Hãy chọn nguồn hoặc đích trước.
zh_hans: 请先选择来源或目标。
zh_hant: 請先選擇來源或目標。

source: No Tables in Common
fr: Pas de tables en commun

source: Schema the match is in, null on an engine without schemas
fr: Schéma dans lequel la correspondance se trouve, nul sur un moteur sans schémas.

source: Untitled
fr: Sans titre
ko: 제목 없음
vi: Không có tiêu đề
zh_hans: 未命名
zh_hant: 未命名

source: %lld-%lld of ~%lld ^[rows](inflect: true)
fr: %lld-%lld de ~%lld ^[rangs](inflect: vrai)
ko: %1$lld-%2$lld / ~%3$lld행
tr: %lld-%lld / ~%lld satır
vi: %lld-%lld trên ~%lld dòng
zh_hans: %lld-%lld / ~%lld行
zh_hant: %1$lld-%2$lld / ~%3$lld 列

source: Safe Mode Is Read-Only
fr: Le mode sécurisé est en lecture seule
ko: 안전 모드는 읽기 전용입니다
tr: Safe Mode Salt Okunur
vi: Chế độ an toàn đang ở mức chỉ đọc
zh_hans: 安全模式为只读
zh_hant: 安全模式為唯讀

source: Last checked: never
fr: Dernière vérification : jamais

source: Match any
fr: Correspondre à n'importe lequel
ko: 하나라도 일치
tr: Herhangi biriyle eşleştir
vi: Khớp bất kỳ
zh_hans: 匹配任一
zh_hant: 符合任一

source: Execute Without Limit
fr: Exécuter sans limite
ko: 제한 없이 실행
tr: Limitsiz Çalıştır
vi: Chạy không giới hạn
zh_hans: 不限行数执行
zh_hant: 不限列數執行

source: Last query: %@
fr: Dernière requête : %@
ko: 마지막 쿼리: %@
tr: Son sorgu: %@
vi: Truy vấn gần nhất: %@
zh_hans: 上次查询: %@
zh_hant: 上次查詢:%@

source: Query review on %@
fr: Examen de la requête sur %@
ko: %@에 대한 쿼리 검토
tr: %@ üzerinde sorgu incelemesi
vi: Rà soát truy vấn trên %@
zh_hans: 在 %@ 上的查询审查
zh_hant: 在 %@ 上的查詢審查

source: Email:
fr: Courriel :
ko: 이메일:
tr: E-posta:
zh_hans: 邮箱:
zh_hant: 電子郵件：

source: Already restored
fr: Déjà restauré
ko: 이미 복원됨
tr: Zaten geri yüklendi
vi: Đã khôi phục
zh_hans: 已恢复
zh_hant: 已還原

source: Import %@…
fr: Importer %@...
ko: %@ 가져오기…
tr: %@ İçe Aktar…
vi: Nhập %@…
zh_hans: 导入 %@…
zh_hant: 匯入 %@…

source: Window id, stable across tools
fr: Identifiant de la fenêtre, stable à travers les outils
ko: 도구 간에 일관된 창 id
tr: Araçlar arasında değişmeyen pencere kimliği
vi: Window id, ổn định giữa các công cụ
zh_hans: 窗口 id，在各工具之间保持稳定
zh_hant: 視窗 id，在各工具之間保持穩定

source: Copy
fr: Copie
ko: 복사
tr: Kopyala
vi: Sao chép
zh_hans: 复制
zh_hant: 複製

source: Add SSH Server…
fr: Ajouter le serveur SSH...

source: %d added
fr: %d ajouté
ko: %d개 추가됨
tr: %d eklendi
vi: %d đã thêm
zh_hans: 已添加 %d 个
zh_hant: 已新增 %d 個

source: No SSH password was found for this connection. Enter it in the SSH settings and try again.
fr: Aucune mot de passe SSH n'a été trouvée pour cette connexion. Veuillez la saisir dans les paramètres SSH et réessayer.

source: Open Query
fr: Requête ouverte
ko: 쿼리 열기
tr: Sorgu Aç
vi: Mở truy vấn
zh_hans: 打开查询
zh_hant: 開啟查詢

source: Import Data From
fr: Importer des données de

source: SAP's in-memory SQL database
fr: La base de données SQL en mémoire de SAP

source: Decimal
fr: Décimal
ko: 10진수
tr: Ondalık
vi: Thập phân
zh_hans: 十进制
zh_hant: 十進位

source: Stored in the macOS Keychain and written to a temporary file only while the proxy runs.
fr: Stocké dans le portefeuille de clés macOS et écrit dans un fichier temporaire uniquement pendant la durée de fonctionnement du proxy.
ko: macOS 키체인에 저장되며, 프록시가 실행되는 동안에만 임시 파일에 기록됩니다.
tr: macOS Keychain'de saklanır ve yalnızca proxy çalışırken geçici bir dosyaya yazılır.
vi: Được lưu trong macOS Keychain và chỉ ghi ra tệp tạm khi proxy đang chạy.
zh_hans: 保存在 macOS 钥匙串中，仅在代理运行期间写入临时文件。
zh_hant: 儲存在 macOS 鑰匙圈中，僅在代理執行期間寫入暫存檔案。

source: Import
fr: Importation
ko: 가져오기
tr: İçe Aktar
vi: Nhập
zh_hans: 导入
zh_hant: 匯入

source: This keyword is already in use
fr: Cette mot-clé est déjà en usage.
ko: 이 키워드는 이미 사용 중입니다
tr: Bu anahtar sözcük zaten kullanımda
vi: Từ khoá này đã được sử dụng
zh_hans: 此关键字已被使用
zh_hant: 此關鍵字已被使用

source: View Mode
fr: Mode d'affichage
ko: 보기 모드
tr: Görünüm Modu
vi: Chế độ xem
zh_hans: 视图模式
zh_hant: 檢視模式

source: Required only when the server enforces mutual TLS authentication.
fr: Nécessaire uniquement lorsque le serveur applique l'authentification TLS mutuelle.
ko: 서버에서 상호 TLS 인증을 적용하는 경우에만 필요합니다.
tr: Yalnızca sunucu karşılıklı TLS kimlik doğrulamasını zorunlu kıldığında gerekli.
vi: Chỉ cần khi máy chủ bắt buộc xác thực TLS hai chiều.
zh_hans: 仅当服务器强制双向 TLS 认证时需要。
zh_hant: 僅當伺服器強制雙向 TLS 驗證時需要。

source: Open editor
fr: Ouvrir l'éditeur
ko: 편집기 열기
tr: Düzenleyiciyi aç
vi: Mở trình soạn thảo
zh_hans: 打开编辑器
zh_hant: 開啟編輯器

# Column count mismatch on line %lld: expected %lld columns, found %lld.
source: Column count mismatch on line %1$lld: expected %2$lld columns, found %3$lld.
fr: Inégalité de nombre de colonnes sur la ligne %1$lld : colonnes %2$lld attendues, %3$lld trouvées.
ko: %1$lld번째 줄의 열 수가 일치하지 않습니다. 예상: %2$lld개, 실제: %3$lld개.
tr: Satır %lld'de sütun sayısı uyuşmazlığı: %lld sütun bekleniyordu, %lld bulundu.
vi: Số cột không khớp ở dòng %1$lld: mong đợi %2$lld cột, tìm thấy %3$lld.
zh_hans: 第 %lld 行列数不匹配：期望 %lld 列，实际 %lld 列。
zh_hant: 第 %1$lld 行欄位數不符：預期 %2$lld 個欄位,實際 %3$lld 個。

source: A newer TablePro is required to load this plugin.
fr: Un TablePro plus récent est nécessaire pour charger ce plugin.
ko: 이 플러그인을 불러오려면 최신 버전의 TablePro가 필요합니다.
tr: Bu eklentiyi yüklemek için daha yeni bir TablePro gerekiyor.
vi: Cần phiên bản TablePro mới hơn để tải plugin này.
zh_hans: 需要更新版本的TablePro才能加载此插件。
zh_hant: 需要更新版本的 TablePro 才能載入這個外掛。

source: Total Blocks
fr: Blocs totaux
ko: 총 블록 수
tr: Toplam Blok
vi: Tổng số khối
zh_hans: 总块数
zh_hant: 區塊總數

source: List Databases
fr: Liste des bases de données
ko: 데이터베이스 목록
tr: Veritabanlarını Listele
vi: Liệt kê cơ sở dữ liệu
zh_hans: 列出数据库
zh_hant: 列出資料庫

source: Diagnostic Info
fr: Informations diagnostiques
ko: 진단 정보
tr: Tanılama Bilgileri
vi: Thông tin chẩn đoán
zh_hans: 诊断信息
zh_hant: 診斷資訊

source: Could not read password file: %@
fr: Impossible de lire le fichier de mot de passe : %@
ko: 암호 파일을 읽을 수 없습니다: %@
tr: Parola dosyası okunamadı: %@
vi: Không thể đọc tệp mật khẩu: %@
zh_hans: 无法读取密码文件：%@
zh_hant: 無法讀取密碼檔案：%@

source: Default connection policy
fr: Politique de connexion par défaut
ko: 기본 연결 정책
tr: Varsayılan bağlantı ilkesi
vi: Chính sách kết nối mặc định
zh_hans: 默认连接策略
zh_hant: 預設連線原則

source: This database reports no schemas.
fr: Cette base de données ne rapporte aucun schéma.

source: Data Size
fr: Taille des données
ko: 데이터 크기
tr: Veri Boyutu
vi: Kích thước dữ liệu
zh_hans: 数据大小
zh_hant: 資料大小

source: Hide Results
fr: Cacher les résultats
ko: 결과 가리기
tr: Sonuçları Gizle
vi: Ẩn kết quả
zh_hans: 隐藏结果
zh_hant: 隱藏結果

source: This connection is not open.
fr: Cette connexion n'est pas ouverte.

source: Unlimited
fr: Illimité
ko: 무제한
tr: Sınırsız
vi: Không giới hạn
zh_hans: 无限制
zh_hant: 無限制

source: Seats on a team license are managed on tablepro.app.
fr: Les places sur une licence d'équipe sont gérées sur tablepro.app.
ko: 팀 라이선스의 좌석은 tablepro.app에서 관리합니다.
tr: Takım lisansındaki koltuklar tablepro.app üzerinden yönetilir.
vi: Các chỗ trên giấy phép nhóm được quản lý tại tablepro.app.
zh_hans: 团队许可证的席位在 tablepro.app 上管理。
zh_hant: 團隊授權的席位在 tablepro.app 上管理。

source: Reset column widths, order, and visibility to defaults
fr: Réinitialiser les largeurs des colonnes, l'ordre et la visibilité aux valeurs par défaut.
ko: 열 너비, 순서 및 표시 여부를 기본값으로 재설정
tr: Sütun genişliklerini, sırasını ve görünürlüğünü varsayılana sıfırla
vi: Đặt lại độ rộng, thứ tự và khả năng hiển thị của cột về mặc định
zh_hans: 将列宽、顺序和显示状态重置为默认值
zh_hant: 將欄寬、順序與顯示狀態重設為預設值

source: Your Changes
fr: Vos modifications
ko: 변경 사항
tr: Değişiklikleriniz
vi: Thay đổi của bạn
zh_hans: 你的更改
zh_hant: 你的變更

source: Connection URL
fr: URL de connexion
ko: 연결 URL
tr: Bağlantı URL'si
vi: URL kết nối
zh_hans: 连接 URL
zh_hant: 連線 URL

source: File encoding (%@) cannot represent these characters. Convert the file to UTF-8 to save.
fr: L'encodage du fichier (%@) ne peut pas représenter ces caractères. Convertissez le fichier en UTF-8 pour l'enregistrer.
ko: 파일 인코딩(%@)으로는 이 문자를 표현할 수 없습니다. 저장하려면 파일을 UTF-8로 변환하십시오.
tr: Dosya kodlaması (%@) bu karakterleri temsil edemiyor. Kaydetmek için dosyayı UTF-8'e dönüştürün.
vi: Bảng mã của tệp (%@) không thể biểu diễn các ký tự này. Hãy chuyển tệp sang UTF-8 để lưu.
zh_hans: 文件编码（%@）无法表示这些字符。请将文件转换为 UTF-8 后再保存。
zh_hant: 檔案編碼（%@）無法表示這些字。請將檔案轉換為 UTF-8 後再儲存。

source: Rows per page
fr: Lignes par page
ko: 페이지당 행 수
tr: Sayfa başına satır
vi: Số hàng mỗi trang
zh_hans: 每页行数
zh_hant: 每頁列數

source: localhost
fr: Local hôte

source: Tabs
fr: Rubriques
ko: 탭
vi: Tab
zh_hans: 标签页
zh_hant: 分頁

source: %1$@ (%2$lld of %3$lld), %4$lld rows
fr: %1$@ (%2$lld de %3$lld), %4$lld lignes

source: Find
fr: Trouver
ko: 찾기
tr: Bul
vi: Tìm
zh_hans: 查找
zh_hant: 尋找

source: Auto-show inspector on row select
fr: Inspectionnaire automatique de l'affichage sur la sélection de la rangée
ko: 행 선택 시 인스펙터 자동 표시
tr: Satır seçiminde denetçiyi otomatik göster
vi: Tự động hiện thanh kiểm tra khi chọn dòng
zh_hans: 选中行时自动显示检查器
zh_hant: 選取列時自動顯示檢閱器

source: Unknown
fr: Inconnu
ko: 알 수 없음
tr: Bilinmiyor
vi: Không xác định
zh_hans: 未知
zh_hant: 未知

source: This plugin needs a newer version of TablePro. Update TablePro, then install it again.
fr: Ce plugin nécessite une version plus récente de TablePro. Mettez à jour TablePro, puis installez-le à nouveau.

source: Length:
fr: Longueur :
ko: 길이:
tr: Uzunluk:
vi: Độ dài:
zh_hans: 长度:
zh_hant: 長度:

source: Choose a private key file
fr: Choisissez un fichier de clé privée
ko: 개인 키 파일 선택
tr: Özel anahtar dosyası seçin
vi: Chọn tệp private key
zh_hans: 选择私钥文件
zh_hant: 選擇私密金鑰檔案

source: The source's indexes could not be read: %@
fr: Les index de la source ne pouvaient pas être lus : %@

source: Row number
fr: Numéro de rangée
ko: 행 번호
tr: Satır numarası
vi: Số hàng
zh_hans: 行号
zh_hant: 列號

source: Import Commands
fr: Commandes d'importation

source: More than one check constraint is named %@. Change or delete all of them in the same save.
fr: Plus d'une contrainte de vérification est nommée %@. Changez-les ou supprimez-les tous dans le même enregistrement.

source: Remove %@?
fr: Supprimer %@?
ko: %@을(를) 제거하시겠습니까?
tr: %@ kaldırılsın mı?
vi: Gỡ %@?
zh_hans: 移除 %@？
zh_hant: 移除 %@？

source: Failures
fr: Échecs
ko: 실패한 쿼리
tr: Başarısız Sorgular
vi: Truy vấn lỗi
zh_hans: 失败查询
zh_hant: 失敗查詢

source: %lld of %lld ^[rows](inflect: true) selected
fr: %lld de %lld ^[rows](inflect: true) sélectionnés
ko: %1$lld/%2$lld행 선택됨
tr: %lld / %lld satır seçildi
vi: Đã chọn %lld trên %lld dòng
zh_hans: 已选择%lld/%lld行
zh_hant: 已選取 %1$lld / %2$lld 列

source: Set DEFAULT
fr: Définir PAR DEF AUTEUR
ko: DEFAULT로 설정
vi: Đặt DEFAULT
zh_hans: 设为 DEFAULT
zh_hant: 設為 DEFAULT
